src/cf/src/InformationRegisters/СоставТехКарты/СоставТехКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставТехКарты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.НормаРасхода</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>СпособИзготовления</name>
    <type>
      <types>EnumRef.СпособыИзготовления</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентПотерь</name>
    <type>
      <types>DefinedType.Процент</types>
    </type>
  </resources>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Documents/ТехнологическаяКарта/ТехнологическаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТехнологическаяКарта</name>
  <registerRecords>InformationRegister.СоставТехКарты</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособИзготовления</name>
      <type>
        <types>EnumRef.СпособыИзготовления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПотерь</name>
      <type>
        <types>DefinedType.Процент</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьДатуУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияСоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьОписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийРегламент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.КачествоТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.КодыТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьвЛКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСтикеры</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваНоменклатуры</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыСвойствНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Хранение</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЯчейкиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическаяКарта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕИ</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКомплекта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Станки</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ПроизводственноеОборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/CommonModules/ТехнологическиеКарты/Module.bsl
#Область ПрограммныйИнтерфейс

// Состав технологических карт, действующих на дату среза.
// Версия карты - это документ-регистратор: берутся строки последнего по дате документа
// продукции, а не срез последних по измерениям, иначе в состав подмешались бы материалы,
// удалённые в новой версии карты. Маркерная запись отмены карты (пустой материал) в
// результат не попадает: у отменённой карты состав пустой.
//
// Параметры:
//  Продукция - Массив, СправочникСсылка.Номенклатура - позиции, чьи карты нужны.
//  Дата      - Дата - момент среза; не заполнена - текущая дата сеанса.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Продукция, Регистратор, Номенклатура (материал),
//                    Характеристика, Упаковка, Количество (на единицу продукции).
//                    Строки упорядочены по продукции и номеру строки карты.
//
Функция СоставТехкарт(Продукция, Дата = Неопределено) Экспорт
	
	Запрос = ЗапросПоСоставу(Продукция, Дата);
	Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
	                              |	ВТСостав.Продукция КАК Продукция,
	                              |	ВТСостав.Регистратор КАК Регистратор,
	                              |	ВТСостав.Номенклатура КАК Номенклатура,
	                              |	ВТСостав.Характеристика КАК Характеристика,
	                              |	ВТСостав.Упаковка КАК Упаковка,
	                              |	ВТСостав.Количество КАК Количество
	                              |ИЗ
	                              |	ВТСостав КАК ВТСостав
	                              |
	                              |УПОРЯДОЧИТЬ ПО
	                              |	ВТСостав.Продукция,
	                              |	ВТСостав.НомерСтроки";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Действующие на дату версии технологических карт.
// Отменённая карта (маркерная запись с пустым материалом) - тоже версия: она возвращается,
// иначе повторная запись пустого состава заводила бы новый документ каждый день.
//
// Параметры:
//  Продукция - Массив, СправочникСсылка.Номенклатура - позиции, чьи версии нужны.
//  Дата      - Дата - момент среза; не заполнена - текущая дата сеанса.
//
// Возвращаемое значение:
//  Соответствие - ключ СправочникСсылка.Номенклатура (продукция), значение Структура:
//                  * Версия     - ДокументСсылка.ТехнологическаяКарта - регистратор версии.
//                  * ДействуетС - Дата - период записей этой версии.
//                 Позиции без карты в соответствие не попадают.
//
Функция ТекущиеТехкарты(Продукция, Дата = Неопределено) Экспорт
	
	Запрос = ЗапросПоСоставу(Продукция, Дата);
	Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                              |	Состав.Продукция КАК Продукция,
	                              |	Состав.Регистратор КАК Регистратор,
	                              |	Состав.Период КАК Период
	                              |ИЗ
	                              |	РегистрСведений.СоставТехКарты КАК Состав
	                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВерсии КАК ВТВерсии
	                              |		ПО Состав.Продукция = ВТВерсии.Продукция
	                              |			И Состав.Период = ВТВерсии.Период";
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Версия = Новый Структура("Версия, ДействуетС", Выборка.Регистратор, Выборка.Период);
		Результат.Вставить(Выборка.Продукция, Версия);
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

// Состав конкретной версии технологической карты.
// Маркерная запись отмены карты в результат не попадает: у отменённой карты состав пустой.
//
// Параметры:
//  Регистратор - ДокументСсылка.ТехнологическаяКарта - версия карты.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Номенклатура (материал), Характеристика, Упаковка, Количество;
//                    имена совпадают с реквизитами ТЧМатериалы документа. Строки упорядочены
//                    по номеру строки записей регистра.
//
Функция СоставТехкартыПоРегистратору(Регистратор) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Состав.Материал КАК Номенклатура,
	                      |	Состав.Характеристика КАК Характеристика,
	                      |	Состав.Упаковка КАК Упаковка,
	                      |	Состав.Количество КАК Количество
	                      |ИЗ
	                      |	РегистрСведений.СоставТехКарты КАК Состав
	                      |ГДЕ
	                      |	Состав.Регистратор = &Регистратор
	                      |	И Состав.Материал <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Состав.НомерСтроки");
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Веса позиций продукции для распределения себестоимости мультивыпуска.
// Правило переносится дословно из прежнего расчёта по табличной части справочника: если карты
// нет хотя бы у одной позиции набора, коэффициенты всех позиций равны единице, а не смеси
// «карта / единица». Отменённая карта считается отсутствующей: её суммарный расход равен нулю.
//
// Параметры:
//  Продукция - Массив, СправочникСсылка.Номенклатура - позиции выпуска.
//  Дата      - Дата - момент среза; не заполнена - текущая дата сеанса.
//
// Возвращаемое значение:
//  Соответствие - ключ СправочникСсылка.Номенклатура, значение Число: расход сырья
//                 на единицу продукции по карте либо 1 для всего набора.
//
Функция КоэффициентыТехкарт(Продукция, Дата = Неопределено) Экспорт
	
	Запрос = ЗапросПоСоставу(Продукция, Дата);
	Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
	                              |	СпрНоменклатура.Ссылка КАК Номенклатура,
	                              |	СУММА(ЕСТЬNULL(ВТСостав.Количество, 0)) КАК Коэффициент
	                              |ИЗ
	                              |	Справочник.Номенклатура КАК СпрНоменклатура
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСостав КАК ВТСостав
	                              |		ПО СпрНоменклатура.Ссылка = ВТСостав.Продукция
	                              |ГДЕ
	                              |	СпрНоменклатура.Ссылка В (&Продукция)
	                              |
	                              |СГРУППИРОВАТЬ ПО
	                              |	СпрНоменклатура.Ссылка";
	ТЗ = Запрос.Выполнить().Выгрузить();
	ПоТехкартам = ТЗ.Количество() > 0 И ТЗ.НайтиСтроки(Новый Структура("Коэффициент", 0)).Количество() = 0;
	Результат = Новый Соответствие;
	Для Каждого Стр Из ТЗ Цикл
		Результат.Вставить(Стр.Номенклатура, ?(ПоТехкартам, Стр.Коэффициент, 1));
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

// Материалы, нужные для выпуска заданного количества продукции по действующим картам.
// Одинаковые материалы разных позиций продукции сводятся в одну строку.
//
// Параметры:
//  ТЗПродукция - ТаблицаЗначений - выпускаемая продукция, колонки Номенклатура
//                и КоличествоУпаковок.
//  Дата        - Дата - момент среза карт; не заполнена - текущая дата сеанса.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Номенклатура (материал), Характеристика, Упаковка,
//                    КоличествоЗаЕдиницу и КоличествоУпаковок (итог по всей продукции).
//                    Упаковка заполняется только при включённой функциональной опции
//                    «Использовать упаковку», иначе колонка пуста: количество в строке
//                    документа считается по базовой единице, как до перехода на регистр.
//                    Пустая таблица - ни у одной позиции карты нет.
//
Функция ЗаполнитьМатериалыПоТехкартам(ТЗПродукция, Дата = Неопределено) Экспорт
	
	Запрос = ЗапросПоСоставу(ТЗПродукция.ВыгрузитьКолонку("Номенклатура"), Дата);
	Запрос.УстановитьПараметр("ТЗПродукция", ТЗПродукция);
	Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
	                              |	ВЫРАЗИТЬ(ТЗ.Номенклатура КАК Справочник.Номенклатура) КАК Продукция,
	                              |	ВЫРАЗИТЬ(ТЗ.КоличествоУпаковок КАК ЧИСЛО(15, 3)) КАК КоличествоУпаковок
	                              |ПОМЕСТИТЬ ВТПродукция
	                              |ИЗ
	                              |	&ТЗПродукция КАК ТЗ
	                              |;
	                              |
	                              |////////////////////////////////////////////////////////////////////////////////
	                              |ВЫБРАТЬ
	                              |	ВТСостав.Номенклатура КАК Номенклатура,
	                              |	ВТСостав.Характеристика КАК Характеристика,
	                              |	ВТСостав.Упаковка КАК Упаковка,
	                              |	ВТСостав.Количество КАК КоличествоЗаЕдиницу,
	                              |	СУММА(ВТПродукция.КоличествоУпаковок * ВТСостав.Количество) КАК КоличествоУпаковок
	                              |ИЗ
	                              |	ВТПродукция КАК ВТПродукция
	                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСостав КАК ВТСостав
	                              |		ПО ВТПродукция.Продукция = ВТСостав.Продукция
	                              |
	                              |СГРУППИРОВАТЬ ПО
	                              |	ВТСостав.Номенклатура,
	                              |	ВТСостав.Характеристика,
	                              |	ВТСостав.Упаковка,
	                              |	ВТСостав.Количество";
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУпаковку") Тогда
		// Без опции упаковка в документ не уходит (решение владельца 2026-09-10): иначе
		// РаботаСДокументамиКлиентСервер.РассчитатьСтроку пересчитала бы количество по
		// коэффициенту упаковки и сдвинула суммы выпусков, которые до перехода на регистр
		// считались по базовой единице. Материалы, различавшиеся только упаковкой, после
		// очистки колонки сводятся в одну строку.
		ТЗ.ЗаполнитьЗначения(Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка, "Упаковка");
		ТЗ.Свернуть("Номенклатура, Характеристика, Упаковка, КоличествоЗаЕдиницу", "КоличествоУпаковок");
	КонецЕсли;
	Возврат ТЗ;
	
КонецФункции

// Записывает и проводит технологическую карту продукции.
// Версия карты - это её регистратор, поэтому повторная запись в тот же день перезаписывает
// документ этого дня, а не заводит второй. Пустой состав - законное состояние: карта
// отменяется, проведение пишет маркерную запись.
//
// Параметры:
//  Продукция - СправочникСсылка.Номенклатура - продукция карты.
//  Состав    - ТаблицаЗначений, ТабличнаяЧастьОбъекта, ДанныеФормыКоллекция - строки состава
//              с реквизитами Номенклатура, Характеристика, Упаковка, Количество;
//              Неопределено или пусто - карта отменяется.
//  Дата      - Дата - дата версии; не заполнена - текущая дата сеанса.
//
// Возвращаемое значение:
//  ДокументСсылка.ТехнологическаяКарта - записанный документ версии.
//
Функция ЗаписатьТехкарту(Продукция, Состав, Дата = Неопределено) Экспорт
	
	МоментЗаписи = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
	Ссылка = ДокументДня(Продукция, МоментЗаписи);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ДокОбъект = Ссылка.ПолучитьОбъект();
	Иначе
		ДокОбъект = Документы.ТехнологическаяКарта.СоздатьДокумент();
		ДокОбъект.Заполнить(Неопределено);
		ДокОбъект.Дата = МоментЗаписи;
	КонецЕсли;
	ДокОбъект.Номенклатура = Продукция;
	ДокОбъект.ТЧМатериалы.Очистить();
	Если Состав <> Неопределено Тогда
		Для Каждого Стр Из Состав Цикл
			ЗаполнитьЗначенияСвойств(ДокОбъект.ТЧМатериалы.Добавить(), Стр,
				"Номенклатура, Характеристика, Упаковка, Количество");
		КонецЦикла;
	КонецЕсли;
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Возврат ДокОбъект.Ссылка;
	
КонецФункции

// Отличается ли состав от записанного в указанной версии карты.
// Перестановка строк и разная разрядность количества отличием не считаются: строки
// сравниваются как упорядоченный набор ключей «материал + характеристика + упаковка +
// количество с тремя знаками».
//
// Параметры:
//  Регистратор - ДокументСсылка.ТехнологическаяКарта - версия, с которой сравниваем;
//                пустая ссылка - записанного состава нет.
//  Состав      - ТаблицаЗначений, ТабличнаяЧастьОбъекта, ДанныеФормыКоллекция - строки
//                с реквизитами Номенклатура, Характеристика, Упаковка, Количество;
//                Неопределено - состав пуст.
//
// Возвращаемое значение:
//  Булево - Истина, если состав нужно записывать новой версией.
//
Функция СоставОтличается(Регистратор, Состав) Экспорт
	
	Записанный = СоставТехкартыПоРегистратору(Регистратор);
	Возврат КлючСостава(Записанный) <> КлючСостава(Состав);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заготовка запроса: временные таблицы ВТВерсии и ВТСостав.
// ВТВерсии - период действующей на дату версии карты по каждой позиции продукции; строится
// без отбора по материалу, иначе отменённая карта откатилась бы к прежней версии.
// ВТСостав - строки этой версии без маркерной записи отмены.
//
// Параметры:
//  Продукция - Массив, СправочникСсылка.Номенклатура - позиции, чьи карты нужны.
//  Дата      - Дата - момент среза; не заполнена - текущая дата сеанса.
//
// Возвращаемое значение:
//  Запрос - с установленными параметрами Продукция и Дата; текст завершается разделителем
//           пакета, к нему дописывается итоговый запрос.
//
Функция ЗапросПоСоставу(Продукция, Дата)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Состав.Продукция КАК Продукция,
	                      |	МАКСИМУМ(Состав.Период) КАК Период
	                      |ПОМЕСТИТЬ ВТВерсии
	                      |ИЗ
	                      |	РегистрСведений.СоставТехКарты КАК Состав
	                      |ГДЕ
	                      |	Состав.Продукция В (&Продукция)
	                      |	И Состав.Период <= &Дата
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Состав.Продукция
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Состав.Продукция КАК Продукция,
	                      |	Состав.Регистратор КАК Регистратор,
	                      |	Состав.НомерСтроки КАК НомерСтроки,
	                      |	Состав.Материал КАК Номенклатура,
	                      |	Состав.Характеристика КАК Характеристика,
	                      |	Состав.Упаковка КАК Упаковка,
	                      |	Состав.Количество КАК Количество
	                      |ПОМЕСТИТЬ ВТСостав
	                      |ИЗ
	                      |	РегистрСведений.СоставТехКарты КАК Состав
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВерсии КАК ВТВерсии
	                      |		ПО Состав.Продукция = ВТВерсии.Продукция
	                      |			И Состав.Период = ВТВерсии.Период
	                      |ГДЕ
	                      |	Состав.Материал <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |");
	Запрос.УстановитьПараметр("Продукция", Продукция);
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()));
	Возврат Запрос;
	
КонецФункции

// Проведённая или записанная карта продукции за тот же день, что и момент записи.
//
// Параметры:
//  Продукция - СправочникСсылка.Номенклатура - продукция карты.
//  Момент    - Дата - момент записи новой версии.
//
// Возвращаемое значение:
//  ДокументСсылка.ТехнологическаяКарта - последний документ этого дня либо пустая ссылка.
//
Функция ДокументДня(Продукция, Момент)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Карта.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ТехнологическаяКарта КАК Карта
	                      |ГДЕ
	                      |	Карта.Номенклатура = &Продукция
	                      |	И Карта.Дата МЕЖДУ &НачалоДня И &КонецДня
	                      |	И НЕ Карта.ПометкаУдаления
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Карта.Дата УБЫВ");
	Запрос.УстановитьПараметр("Продукция", Продукция);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(Момент));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(Момент));
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Документы.ТехнологическаяКарта.ПустаяСсылка());
	
КонецФункции

// Сравнимое представление состава: отсортированный список строк «материал + характеристика +
// упаковка + количество». Сортировка убирает влияние порядка строк, формат с тремя знаками -
// влияние разрядности количества.
//
// Параметры:
//  Состав - ТаблицаЗначений, ТабличнаяЧастьОбъекта, ДанныеФормыКоллекция, Неопределено -
//           строки состава.
//
// Возвращаемое значение:
//  Строка - представление состава для сравнения.
//
Функция КлючСостава(Состав)
	
	Строки = Новый СписокЗначений;
	Если Состав <> Неопределено Тогда
		Для Каждого Стр Из Состав Цикл
			Ключ = XMLСтрока(Стр.Номенклатура) + "|" + XMLСтрока(Стр.Характеристика)
				+ "|" + XMLСтрока(Стр.Упаковка)
				+ "|" + Формат(Стр.Количество, "ЧДЦ=3; ЧРД=.; ЧГ=0");
			Строки.Добавить(Ключ);
		КонецЦикла;
	КонецЕсли;
	Строки.СортироватьПоЗначению();
	Результат = "";
	Для Каждого Элемент Из Строки Цикл
		Результат = Результат + Элемент.Значение + Символы.ПС;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

#КонецОбласти
